text_menu = f'''
❓ О боте                                       –  /about 
🔁 Сменить вид меню              –  /view
_____________________________________________
        📱 Функции
💰 Конвертор валют                 –  /converter
🧮 Калькулятор                          –  /calculator
🗺 Моя локация                         –  /my_location
_____________________________________________
        👤 Обратная связь
📒 Отзывы и предложения    –  /review
🖌 Написать разработчику    –  /dev
📄 Обновления                           –  /updates
'''

about_text = f'''
💠MultiTool - многофункциональный бот
Добро пожаловать в MultiTool! Спасибо что используйте именно его!

        👾 О боте
Обеспечивая пользователя множеством актуальных, интересных, нужных и удобных функций,  бот по праву может считаться универсальным и многозадачным. Кроме того, легкий и быстрый доступ к телеграмму делает и использование бота таким же легким и быстрым. Ведь всего в пару кликов вы выполните поставленную задачу не прибегая к использованию браузера или приложений.
    Вам всего то нужно:
        1. Открыть телеграмм;
        2. Открыть MultiTool;
        3. Выбрать нужную функцию.
Более того, установив ярлык чата на рабочий стол, вы сократитесь на одно действие. Сделать это можно открыв профиль бота, затем нажав на три точки в правом верхнем углу нажать на "Создать ярлык".
Готово! Теперь весь функционал практически у вас под рукой.

Регулярно бот будет дополняться новыми функциями, а также обновляться по мере возможности. Кроме того, любой пользователь сможет предложить свою идею по дополнению или обновлению бота. Например добавить какую-либо функцию или обновить существующую.
Сделать это можно по команде – /reviews_and_suggestions, там же можно и оставить отзыв. По другим вопросам связываться прямо с разработчиком по команде – /dev. История обновлений просматривается здесь – /updates.


        📓 О командах
📓 Меню(/start) — Стартовое меню всех команд;

❓ О боте(/about) — Вся информация о боте;

🔁Сменить вид меню(/view) – Сменить вид меню на другой:
        Всего есть 2 типа меню:
            1. Меню в виде текста;
            2. Меню в виде кнопок.
_____________________________________________
        📱 Функции
💰 Конвертор валют(/converter) – Узнать курсы валют и конвертировать их;

🧮 Калькулятор(/calculator) – Вычисление выражений;

🗺 Моя локация(/my_location) – Узнать адрес вашего местоположения.
_____________________________________________
        👤 Обратная связь
📒 Отзывы и предложения(/review) – Оставить отзыв или предложение разработчику;

🖌 Написать разработчику(/dev) – Лично написать разработчику по любым вопросам;

📄 Обновления(/updates) – Просмотреть всю историю обновлений.
'''


calculator_text = f'''
+  Прибавить (7 + 2 = 9)
-  Отнять    (7 - 2 = 5)
*  Умножить  (7 * 2 = 14)
/  Разделить (7 / 2 = 3.5)
// Целочисленно разделить (7 // 2 = 3)
^  Возвести в степень (7 ^ 2 = 49)

Введите выражение
'''


updates_text = f'''
version 1.0 — Запуск бота (23.06.2023)
'''


'''         КОМАНДЫ
start -📓 Меню
about - ❓ О боте и командах
view - 🔁 Сменить вид меню
converter - 💰 Конвертор валют
calculator - 🧮 Калькулятор
my_location - 🗺 Моя локация
review - 📒 Отзывы и предложения
dev - 🖌 Написать разработчику
updates - 📄 Обновления
'''
